In [5]:
import numpy as np
import pandas as pd

# Reading and writing text files

In [6]:
# This is how to read a text file as dataframe in Python
df = pd.read_csv('/content/sample_data/sample.txt', header=None)

# When the header is provided as None, there would be no column names
df

       0   1   2
0    man  24  56
1  woman  34  89
2    man  78  60
3    man  89  58
4    man  27  90
5  woman  22  54

In [7]:
# Reading using read_table
df = pd.read_table('/content/sample_data/sample.txt', sep=',', header=None)
df

       0   1   2
0    man  24  56
1  woman  34  89
2    man  78  60
3    man  89  58
4    man  27  90
5  woman  22  54

In [8]:
# Reading only a few number of rows
df = pd.read_csv('/content/sample_data/sample.txt', header=None, nrows=3)
df

       0   1   2
0    man  24  56
1  woman  34  89
2    man  78  60

In [9]:
import sys

# Writing dataframe back into a csv file
df.to_csv(sys.stdout, header=None)

0,man,24,56
1,woman,34,89
2,man,78,60

# Reading data from HTML or a website

In [10]:
df_list = pd.io.html.read_html('https://en.wikipedia.org/wiki/List_of_Tom_Holland_performances')
df_list[0].head()

       Tom Holland                                      Tom Holland.1
0  Holland in 2018                                    Holland in 2018
1             Born     Thomas Stanley Holland (age 25)London, England
2        Education  Wimbledon CollegeBRIT School for Performing Ar...
3       Occupation                                              Actor
4     Years active                                       2006–present

# Merge

In [11]:
df1 = pd.DataFrame({'key': (1, 2, 3), 'values 1': ('a', 'b', 'c')})
df2 = pd.DataFrame({'key': (1, 2, 3), 'values 2': ('d', 'e', 'f')})

In [12]:
df3 = pd.merge(df1, df2, on='key')
df3

   key values 1 values 2
0    1        a        d
1    2        b        e
2    3        c        f

In [13]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
display(df1)
display(df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [14]:
pd.merge(df1, df2, how='right')

  employee        group  hire_date
0     Lisa  Engineering       2004
1      Bob   Accounting       2008
2     Jake  Engineering       2012
3      Sue           HR       2014

In [15]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})
display(df1, df4)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

In [16]:
pd.merge(df1, df4, how='right')

  employee        group supervisor
0      Bob   Accounting      Carly
1     Jake  Engineering      Guido
2     Lisa  Engineering      Guido
3      Sue           HR      Steve

# Merge by index

In [17]:
df1[:-1]

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering

In [18]:
df5 = pd.DataFrame(['Male', 'Female'], index=['Accounting', 'Engineering'])
df5

                  0
Accounting     Male
Engineering  Female

In [19]:
pd.merge(df1, df5, left_on='group', right_index=True)

  employee        group       0
0      Bob   Accounting    Male
1     Jake  Engineering  Female
2     Lisa  Engineering  Female

In [20]:
# Working with datasets that have sub index
df_one = pd.DataFrame({'key1': ['Melvin', 'Albin', 'Malu', 'Ann'], 'key2': [28, 23, 25, 24]})
df_one

     key1  key2
0  Melvin    28
1   Albin    23
2    Malu    25
3     Ann    24

In [21]:
df_two = pd.DataFrame(np.arange(16).reshape(8, 2), index=[['Albin', 'Albin', 'Malu', 'Malu', 'Ann', 'Ann', 'Melvin', 'Melvin'], 
                                                         [23, 11, 25, 13, 24, 12, 28, 14]])
df_two

            0   1
Albin  23   0   1
       11   2   3
Malu   25   4   5
       13   6   7
Ann    24   8   9
       12  10  11
Melvin 28  12  13
       14  14  15

In [22]:
pd.merge(df_one, df_two, left_on=['key1', 'key2'], right_index=True)

     key1  key2   0   1
0  Melvin    28  12  13
1   Albin    23   0   1
2    Malu    25   4   5
3     Ann    24   8   9

# Using Join instead of merge

In [23]:
df_one.join(df_two, on=['key1', 'key2'], how='left')

     key1  key2   0   1
0  Melvin    28  12  13
1   Albin    23   0   1
2    Malu    25   4   5
3     Ann    24   8   9

In [24]:
# Using how = left
df_one['new_column'] = [90, 90, 78, 67]
df_one

     key1  key2  new_column
0  Melvin    28          90
1   Albin    23          90
2    Malu    25          78
3     Ann    24          67

In [25]:
df_one.join(df_two, on=['key1', 'key2'], how='right')

     key1  key2  new_column   0   1
1   Albin    23        90.0   0   1
3   Albin    11         NaN   2   3
2    Malu    25        78.0   4   5
3    Malu    13         NaN   6   7
3     Ann    24        67.0   8   9
3     Ann    12         NaN  10  11
0  Melvin    28        90.0  12  13
3  Melvin    14         NaN  14  15

# Concat

In [26]:
# Numpy
a = np.arange(10).reshape(5, 2)
b = np.arange(20, 30).reshape(5, 2)

display(np.concatenate((a, b), axis=1))
print()
display(np.concatenate((a, b), axis=0))

array([[ 0,  1, 20, 21],
       [ 2,  3, 22, 23],
       [ 4,  5, 24, 25],
       [ 6,  7, 26, 27],
       [ 8,  9, 28, 29]])

array([[ 0,  1],
       [ 2,  3],
       [ 4,  5],
       [ 6,  7],
       [ 8,  9],
       [20, 21],
       [22, 23],
       [24, 25],
       [26, 27],
       [28, 29]])

In [27]:
# Pandas
a_df = pd.DataFrame(a)
b_df = pd.DataFrame(b)
display(pd.concat([a_df, b_df], axis=0))
print()
display(pd.concat([a_df, b_df], axis=1))

# with keys
print()
display(pd.concat([a_df, b_df], axis=1, keys=['cat1', 'cat2']))

    0   1
0   0   1
1   2   3
2   4   5
3   6   7
4   8   9
0  20  21
1  22  23
2  24  25
3  26  27
4  28  29

   0  1   0   1
0  0  1  20  21
1  2  3  22  23
2  4  5  24  25
3  6  7  26  27
4  8  9  28  29

  cat1    cat2
     0  1    0   1
0    0  1   20  21
1    2  3   22  23
2    4  5   24  25
3    6  7   26  27
4    8  9   28  29

In [28]:
# Ignoring the index
a_df = pd.DataFrame(a)
b_df = pd.DataFrame(b)
display(pd.concat([a_df, b_df], axis=1, ignore_index=True))

   0  1   2   3
0  0  1  20  21
1  2  3  22  23
2  4  5  24  25
3  6  7  26  27
4  8  9  28  29

# Combining in pandas

This can be used to replace the nan values in a dataframe or a series with corresponding values in a different series or dataframe.

In [29]:
ser_1 = pd.Series([1, np.nan, 4, 8, np.nan, 3], index=['Q', 'R', 'S', 'T', 'U', 'V'])
print(ser_1)
print()

ser_2 = pd.Series(np.arange(len(ser_1)), index=['Q', 'R', 'S', 'T', 'U', 'V'])
print(ser_2)

Q    1.0
R    NaN
S    4.0
T    8.0
U    NaN
V    3.0
dtype: float64

Q    0
R    1
S    2
T    3
U    4
V    5
dtype: int64

In [30]:
# Using the combine function
ser_1.combine_first(ser_2)

Q    1.0
R    1.0
S    4.0
T    8.0
U    4.0
V    3.0
dtype: float64

# Stacking and unstacking

Stacking and unstacking can be done to change the default index of a dataset.

In [40]:
# Here we are naming the index for rows and columns
df_for_stacking = pd.DataFrame(np.arange(10).reshape(2, 5), index=pd.Index(['Cochin', 'Bangalore'], name='city'),
                               columns=pd.Index(['a', 'b', 'c', 'd', 'e'], name='character'))
df_for_stacking

character  a  b  c  d  e
city
Cochin     0  1  2  3  4
Bangalore  5  6  7  8  9

In [41]:
df_stacked = df_for_stacking.stack()
display(df_stacked)

city       character
Cochin     a            0
           b            1
           c            2
           d            3
           e            4
Bangalore  a            5
           b            6
           c            7
           d            8
           e            9
dtype: int64

In [46]:
# Now lets see how we can reverse the default index
df_reversed = df_stacked.unstack('city')
df_reversed

city       Cochin  Bangalore
character
a               0          5
b               1          6
c               2          7
d               3          8
e               4          9

# Pivotting

In [49]:
for_pivot = pd.read_csv('/sample data for pivot table.csv')
for_pivot.head()

  Sample sales data Unnamed: 1 Unnamed: 2  ... Unnamed: 9 Unnamed: 10  Unnamed: 11
0               NaN        NaN        NaN  ...        NaN         NaN          NaN
1              Date      Color     Region  ...        NaN         NaN          NaN
2          3-Jan-16        Red       West  ...        NaN         NaN          NaN
3         13-Jan-16       Blue      South  ...        NaN         NaN          NaN
4         21-Jan-16      Green       West  ...        NaN         NaN          NaN

[5 rows x 12 columns]

In [54]:
# We are gonna pivot the table to view the dates for which the colors where different and its sales
for_pivot.pivot(index='Sample sales data', columns='Unnamed: 1', values='Unnamed: 4').head()

Unnamed: 1         NaN    Blue Color Green     Red  Silver
Sample sales data
NaN                NaN     NaN   NaN   NaN     NaN     NaN
1-Apr-18           NaN     NaN   NaN   NaN     NaN  $56.00
1-Aug-19           NaN     NaN   NaN   NaN  $96.00     NaN
1-Dec-17           NaN  $96.00   NaN   NaN     NaN     NaN
1-Dec-18           NaN     NaN   NaN   NaN  $84.00     NaN